app/views/badges/_form.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :name, { prompt: true }, { class: "input-field" } %>
---
SELECT "categories".* FROM "categories"