app/views/home/index.html.erb

SELECT "badges".* FROM "badges" INNER JOIN "badge_awards" ON "badges"."id" = "badge_awards"."badge_id" WHERE "badge_awards"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "badges" INNER JOIN "badge_awards" ON "badges"."id" = "badge_awards"."badge_id" WHERE "badge_awards"."user_id" = ?  [["user_id", 1]]
---
  <div class="mt-5">
    <% if current_user.badges.count == 0 %>

SELECT "badges".* FROM "badges" INNER JOIN "badge_awards" ON "badges"."id" = "badge_awards"."badge_id" WHERE "badge_awards"."user_id" = ?  [["user_id", 1]]
---
      <ul class="list-disc">
        <% current_user.badges.each do |badge| %>