app/controllers/activities_controller.rb

  def create
    @activity = @challenge.activities.build(activity_params)
    @activity.user = current_user
    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("note", "amount", "challenge_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["note", "Napped"], ["amount", 3], ["challenge_id", 1], ["created_at", "2023-02-28 20:50:47.271765"], ["updated_at", "2023-02-28 20:50:47.271765"], ["user_id", nil]]

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "note" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["note", "Slept 2 hours"], ["updated_at", "2023-02-15 17:10:21.148420"], ["id", 1]]

  def destroy
    @activity.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]

    def set_activity
      @activity = @challenge.activities.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."challenge_id" = ? AND "activities"."id" = ? LIMIT ?  [["challenge_id", 1], ["id", 5], ["LIMIT", 1]]

    def set_challenge
      @challenge = Challenge.find(params[:challenge_id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]