app/controllers/categories_controller.rb

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "bob"], ["updated_at", "2023-02-08 02:45:56.438148"], ["id", 2]]
---
    def update
        respond_to do |format|
        if @category.update(category_params)