app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("name", "category_id", "goal", "progress", "ends_at", "created_at", "updated_at", "units", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @challenge = current_user.challenges.new(challenge_params)

    respond_to do |format|
      if @challenge.save

UPDATE "challenges" SET "name" = ?, "goal" = ?, "updated_at" = ?, "units" = ? WHERE "challenges"."id" = ?  [["name", "Get all As on midterms"], ["goal", 2], ["updated_at", "2023-02-15 19:39:11.138301"], ["units", "As"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @challenge.update(challenge_params)

DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 4]]
---
  def destroy
    @challenge.destroy

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_challenge
      @challenge = Challenge.find(params[:id])