app/models/badge.rb

SELECT 1 AS one FROM "badge_awards" WHERE "badge_awards"."badge_id" = ? AND "badge_awards"."user_id" = ? AND "badge_awards"."challenge_id" = ? LIMIT ?  [["badge_id", 1], ["user_id", 1], ["challenge_id", 2], ["LIMIT", 1]]
---
  def awarded?(activity)
    BadgeAward.exists?(
      badge_id: id,
      user_id: activity.user_id,
      challenge_id: activity.challenge_id)