app/models/challenge.rb

  def activity_created(activity)
    self.progress = self.progress + activity.amount
    self.save
---
UPDATE "challenges" SET "progress" = ?, "updated_at" = ? WHERE "challenges"."id" = ?  [["progress", 8], ["updated_at", "2023-02-28 20:31:52.186550"], ["id", 1]]

  def activity_deleted(activity)
    self.progress = self.progress - activity.amount
    self.save
---
UPDATE "challenges" SET "progress" = ?, "updated_at" = ? WHERE "challenges"."id" = ?  [["progress", 6], ["updated_at", "2023-03-09 00:41:52.115646"], ["id", 3]]